asciidoc/listings/vol2-clause-appendix-a-mdpws-dev-32-example-00.xml

<?xml version="1.0" encoding="UTF-8"?>
<s12:Envelope
		xmlns:s12="http://www.w3.org/2003/05/soap-envelope"
		xmlns:wsa="http://www.w3.org/2005/08/addressing"
		xmlns:wse="http://schemas.xmlsoap.org/ws/2004/08/eventing"
		xmlns:hm="urn:oid:1.3.6.1.4.1.19376.1.6.2.10.1.3.2"
>
	<s12:Header>
		<wsa:Action>http://schemas.xmlsoap.org/ws/2004/08/eventing/Subscribe</wsa:Action>
		<wsa:MessageID>urn:uuid:3439ded1-12b3-46a4-9d81-a16e8ff1b7c1</wsa:MessageID>
	</s12:Header>
	<s12:Body>
		<wse:Subscribe>
			<wse:EndTo>
				<wsa:Address>https://127.0.0.1:6464/EventSink/EndTo/56db24f3-b210-40d6-9579-6dd750b1a01a</wsa:Address>
			</wse:EndTo>
			<wse:Delivery Mode="http://schemas.xmlsoap.org/ws/2004/08/eventing/DeliveryModes/Push">
				<wse:NotifyTo>
					<wsa:Address>https://127.0.0.1:6464/EventSink/NotifyTo/56db24f3-b210-40d6-9579-6dd750b1a01a</wsa:Address>
				</wse:NotifyTo>
			</wse:Delivery>
			<wse:Filter Dialect="urn:oid:1.3.6.1.4.1.19376.1.6.2.10.1.3.1.1">
				<hm:HistoryQuery>
					<hm:ProvideInitialMdib>true</hm:ProvideInitialMdib>
					<hm:Range>
						<hm:Version SequenceId="urn:uuid:3e8b9c1c-b2a5-497e-9388-d85a018dafd6" StartVersion="0" EndVersion="7"/>
					</hm:Range>
				</hm:HistoryQuery>
			</wse:Filter>
		</wse:Subscribe>
	</s12:Body>
</s12:Envelope>
